Jiajun-Huang/stm32f429-drivers/drivers/Inc/SPI_driver.h
/*
 * SPI_driver.h
 *
 *  Created on: June 5, 2023
 *      Author: Jiajun
 */

#ifndef INC_DRIVER_H_
#define INC_DRIVER_H_

#include "stm32f429.h"

/*
 *  Configuration structure for SPIx peripheral
 */
typedef struct {
    uint8_t SPI_DeviceMode; // master or slave
    uint8_t SPI_BusConfig;  // full duplex, half duplex, simplex
    uint8_t SPI_SclkSpeed;  // clock speed
    uint8_t SPI_DFF;        // data frame format
    uint8_t SPI_CPOL;       // clock polarity
    uint8_t SPI_CPHA;       // clock phase
    uint8_t SPI_SSM;        // software slave management
} SPI_Config_t;

/*
 *Handle structure for SPIx peripheral
 */
typedef struct {
    SPI_RegDef_t
        *pSPIx; /*!< This holds the base address of SPIx(x:0,1,2) peripheral >*/
    SPI_Config_t SPIConfig;
    uint8_t *pTxBuffer; /* !< To store the app. Tx buffer address > */
    uint8_t *pRxBuffer; /* !< To store the app. Rx buffer address > */
    uint32_t TxLen;     /* !< To store Tx len > */
    uint32_t RxLen;     /* !< To store Tx len > */
    uint8_t TxState;    /* !< To store Tx state > */
    uint8_t RxState;    /* !< To store Rx state > */
} SPI_Handle_t;

typedef void (*SPI_CallbackFunc)(SPI_Handle_t *, uint8_t);

/*
 * SPI application states
 */
#define SPI_READY 0
#define SPI_BUSY_IN_RX 1
#define SPI_BUSY_IN_TX 2

/*
 * Possible SPI Application events
 */
#define SPI_EVENT_TX_CMPLT 1 // Transmission complete
#define SPI_EVENT_RX_CMPLT 2 // Reception complete
#define SPI_EVENT_OVR_ERR 3  // Overrun error
#define SPI_EVENT_CRC_ERR 4  // CRC error

/*
 * @SPI_DeviceMode
 */
#define SPI_DEVICE_MODE_MASTER 1
#define SPI_DEVICE_MODE_SLAVE 0

/*
 * @SPI_BusConfig
 */
#define SPI_BUS_CONFIG_FD 1
#define SPI_BUS_CONFIG_HD 2
#define SPI_BUS_CONFIG_SIMPLEX_RXONLY 3

/*
 * @SPI_SclkSpeed
 */
#define SPI_SCLK_SPEED_DIV2 0
#define SPI_SCLK_SPEED_DIV4 1
#define SPI_SCLK_SPEED_DIV8 2
#define SPI_SCLK_SPEED_DIV16 3
#define SPI_SCLK_SPEED_DIV32 4
#define SPI_SCLK_SPEED_DIV64 5
#define SPI_SCLK_SPEED_DIV128 6
#define SPI_SCLK_SPEED_DIV256 7

/*
 * @SPI_DFF
 */
#define SPI_DFF_8BITS 0
#define SPI_DFF_16BITS 1

/*
 * @CPOL
 */
#define SPI_CPOL_HIGH 1
#define SPI_CPOL_LOW 0

/*
 * @CPHA
 */
#define SPI_CPHA_HIGH 1
#define SPI_CPHA_LOW 0

/*
 * @SPI_SSM
 */
#define SPI_SSM_EN 1
#define SPI_SSM_DI 0

/******************************************************************************************
 *								APIs supported
 *by this driver For more information about the APIs check the function
 *definitions
 ******************************************************************************************/
/*
 * Peripheral Clock setup
 */
void SPI_PeriClockControl(SPI_RegDef_t *pSPIx, uint8_t EnorDi);

/*
 * Init and De-init
 */
void SPI_Init(SPI_Handle_t *pSPIHandle);
void SPI_DeInit(SPI_RegDef_t *pSPIx);

/*
 * Data Send and Receive
 */
/**
 * @brief  Send data via SPI blocking mode
 * @param  *pSPIx: base address of the SPI peripheral
 * @param  *pTxBuffer: pointer to your data buffer
 * @param  Len: length of the data buffer
 */
*/
void SPI_SendData(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t Len);
/**
 * @brief Receive data via SPI blocking mode
 * 
 * @param pSPIx base address of the SPI peripheral
 * @param pRxBuffer  pointer to your data buffer
 * @param Len  length of the data buffer
 */
void SPI_ReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t Len);

/**
 * @brief Send data via SPI non-blocking mode (interrupt) 
 * This function will set the handle state to busy and then enable the TXEIE which will generate an interrupt
 * @param pSPIHandle SPI handle structure gobal variable
 * @param pTxBuffer  pointer to your data buffer
 * @param Len  length of the data buffer
 * @return uint8_t the current state of the SPI handle
 */
 */
uint8_t SPI_SendDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pTxBuffer,
                       uint32_t Len);

/**
 * @brief Receive data via SPI non-blocking mode (interrupt) 
 *   This function will set the handle state to busy and then enable the RXNEIE which will generate an interrupt
 * @param pSPIHandle SPI handle structure gobal variable
 * @param pRxBuffer  pointer to your data buffer
 * @param Len length of the data buffer
 * @return uint8_t the current state of the SPI handle
 */
uint8_t SPI_ReceiveDataIT(SPI_Handle_t *pSPIHandle, uint8_t *pRxBuffer,
                          uint32_t Len);

/*
 * IRQ Configuration and ISR handling
 */
void SPI_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void SPI_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);

/**
 * @brief Handle the interrupt
 *  This function will be called from the SPI IRQ handler
 * @param pHandle  SPI handle structure gobal variable
 * @param SPI_CallbackFunc  SPI callback function
 */
void SPI_IRQHandling(SPI_Handle_t *pHandle, SPI_CallbackFunc *SPI_CallbackFunc);

/*
 * Other Peripheral Control APIs
 */
/**
 * @brief  Enable or disable the given SPI peripheral
 * @param  *pSPIx: base address of the SPI peripheral
 * @param  EnOrDi: ENABLE or DISABLE macros
 */
void SPI_PeripheralSwich(SPI_RegDef_t *pSPIx, uint8_t EnOrDi);
/**
 * @brief Enable or disable the given SPI peripheral
 *
 * @param pSPIx  base address of the SPI peripheral
 * @param EnOrDi  ENABLE or DISABLE macros
 */
void SPI_SSISwich(SPI_RegDef_t *pSPIx, uint8_t EnOrDi);
/**
 * @brief Enable or disable the given SPI peripheral
 *
 * @param pSPIx  base address of the SPI peripheral
 * @param EnOrDi  ENABLE or DISABLE macros
 */
void SPI_SSOESwich(SPI_RegDef_t *pSPIx, uint8_t EnOrDi);

void SPI_ClearOVRFlag(SPI_RegDef_t *pSPIx);
void SPI_CloseTransmisson(SPI_Handle_t *pSPIHandle);
void SPI_CloseReception(SPI_Handle_t *pSPIHandle);

/*
 * Application callback
 */
// void SPI_ApplicationEventCallback(SPI_Handle_t *pSPIHandle, uint8_t AppEv);

#endif /* INC_DRIVER_H_ */
